/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   vec_2magnitude.c                                   :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: istalevs <istalevs@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2018/05/13 21:34:34 by istalevs          #+#    #+#             */
/*   Updated: 2018/05/13 23:09:32 by istalevs         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "vmth.h"

/*
**	длинна или модуль(magnitude) вектора (2D)
*/

double	vec_2magnitude(t_v2d v)
{
	return (sqrt(v.x * v.x + v.y * v.y));
}
