/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   vec_2dot.c                                         :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: istalevs <istalevs@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2018/05/13 23:16:31 by istalevs          #+#    #+#             */
/*   Updated: 2018/05/13 23:30:46 by istalevs         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "vmth.h"

/*
**	скалярное произведение векторов 2D (dot product or scalar product)
*/

double		vec_2dot(t_v2d v1, t_v2d v2)
{
	return (v1.x * v2.x + v1.y * v2.y);
}
